export interface CiPattern {
  tune: string;
  origin: string;
  geLyuStr: string;
  rhymePos: number[];
  ciSep: string[];
  geLyuSep: string[];
}

export const CI_PATTERNS: Record<string, CiPattern[]> = {
  "忆江南": [
    {
      "tune": "忆江南",
      "origin": "江南好，风景旧曾谙。日出江花红胜火，春来江水绿如蓝。能不忆江南。",
      "geLyuStr": "平中仄中仄仄平平中仄中平平仄仄中平平仄仄平平平仄仄平平",
      "rhymePos": [
        7,
        21,
        26
      ],
      "ciSep": [
        "江南好　风景旧曾谙",
        "日出江花红胜火　春来江水绿如蓝",
        "能不忆江南"
      ],
      "geLyuSep": [
        "平中仄句中仄仄平平韵",
        "中仄中平平仄仄句中平平仄仄平平韵",
        "平仄仄平平韵"
      ]
    },
    {
      "tune": "忆江南",
      "origin": "江南蝶，斜日一双双。身似何郎曾傅粉，心如韩寿爱偷香。天赋与轻狂。微雨过，薄翅腻烟光。才伴游蜂来小苑，又随飞絮过东墙。长是为花忙。",
      "geLyuStr": "平平仄平仄仄平平平仄平平平仄仄平平平仄仄平平平仄仄平平平仄仄仄仄仄平平平仄平平平仄仄仄平平仄仄平平平仄仄平平",
      "rhymePos": [
        7,
        21,
        26,
        34,
        48,
        53
      ],
      "ciSep": [
        "江南蝶　斜日一双双",
        "身似何郎曾傅粉　心如韩寿爱偷香",
        "天赋与轻狂",
        "微雨过　薄翅腻烟光",
        "才伴游蜂来小苑　又随飞絮过东墙",
        "长是为花忙"
      ],
      "geLyuSep": [
        "平平仄句平仄仄平平韵",
        "平仄平平平仄仄句平平平仄仄平平韵",
        "平仄仄平平韵",
        "平仄仄句仄仄仄平平韵",
        "平仄平平平仄仄句仄平平仄仄平平韵",
        "平仄仄平平韵"
      ]
    },
    {
      "tune": "忆江南",
      "origin": "去岁迎春楼上月。正是西窗，夜凉时节。玉人贪睡坠钗云。粉销妆薄见天真。人非风月长依旧。破镜尘筝，一梦经年瘦。今宵帘幕飏花阴。空馀枕泪独伤心。",
      "geLyuStr": "仄仄平平平仄仄仄仄平平仄平平仄仄平平仄仄平平仄平平仄仄平平平平平仄平平仄仄仄平平仄仄平平仄平平平仄仄平平平平仄仄仄平平",
      "rhymePos": [
        6,
        14,
        21,
        28,
        35,
        44,
        51,
        58
      ],
      "ciSep": [
        "去岁迎春楼上月",
        "正是西窗　夜凉时节",
        "玉人贪睡坠钗云",
        "粉销妆薄见天真",
        "人非风月长依旧",
        "破镜尘筝　一梦经年瘦",
        "今宵帘幕飏花阴",
        "空馀枕泪独伤心"
      ],
      "geLyuSep": [
        "仄仄平平平仄仄仄韵",
        "仄仄平平句仄平平仄韵",
        "仄平平仄仄平平平韵",
        "仄平平仄仄平平韵",
        "平平平仄平平仄换仄韵",
        "仄仄平平句仄仄平平仄韵",
        "平平平仄仄平平换平韵",
        "平平仄仄仄平平韵"
      ]
    }
  ],
  "如梦令": [
    {
      "tune": "如梦令",
      "origin": "曾宴桃源深洞。一曲舞鸾歌凤。长记别伊时，和泪出门相送。如梦。如梦。残月落花烟重。",
      "geLyuStr": "中仄中平中仄中仄中平中仄中仄仄平平中仄中平中仄中仄中仄中仄中平中仄",
      "rhymePos": [
        5,
        11,
        22,
        24,
        26,
        32
      ],
      "ciSep": [
        "曾宴桃源深洞",
        "一曲舞鸾歌凤",
        "长记别伊时　和泪出门相送",
        "如梦",
        "如梦",
        "残月落花烟重"
      ],
      "geLyuSep": [
        "中仄中平中仄韵",
        "中仄中平中仄韵",
        "中仄仄平平句中仄中平中仄韵",
        "中仄韵",
        "中仄叠",
        "中仄中平中仄韵"
      ]
    },
    {
      "tune": "如梦令",
      "origin": "腊半雪梅初绽。玉屑琼英碎剪。素艳与清香，别有风流堪羡。苞嫩。蕊浅。羞破寿阳人面。",
      "geLyuStr": "仄仄仄平平仄仄仄平平仄仄仄仄仄平平仄仄平平平仄平仄仄仄平仄仄平平仄",
      "rhymePos": [
        5,
        11,
        22,
        24,
        26,
        32
      ],
      "ciSep": [
        "腊半雪梅初绽",
        "玉屑琼英碎剪",
        "素艳与清香　别有风流堪羡",
        "苞嫩",
        "蕊浅",
        "羞破寿阳人面"
      ],
      "geLyuSep": [
        "仄仄仄平平仄韵",
        "仄仄平平仄仄韵",
        "仄仄仄平平句仄仄平平平仄韵",
        "平仄韵",
        "仄仄韵",
        "平仄仄平平仄韵"
      ]
    },
    {
      "tune": "如梦令",
      "origin": "疑是水晶宫殿。云女天仙宝宴。吟赏欲黄昏，风送一声羌管。烟淡。霜淡。月在画楼西畔。",
      "geLyuStr": "平仄仄平平仄平仄平平仄仄平仄仄平平平仄仄平平仄平仄平仄仄仄仄平平仄",
      "rhymePos": [
        5,
        11,
        22,
        24,
        26,
        32
      ],
      "ciSep": [
        "疑是水晶宫殿",
        "云女天仙宝宴",
        "吟赏欲黄昏　风送一声羌管",
        "烟淡",
        "霜淡",
        "月在画楼西畔"
      ],
      "geLyuSep": [
        "平仄仄平平仄韵",
        "平仄平平仄仄韵",
        "平仄仄平平句平仄仄平平仄韵",
        "平仄韵",
        "平仄叠",
        "仄仄仄平平仄韵"
      ]
    }
  ],
  "浣溪沙": [
    {
      "tune": "浣溪沙",
      "origin": "宿醉离愁慢髻鬟。六铢衣薄惹轻寒。慵红闷翠掩青鸾。罗袜况兼金菡萏，雪肌仍是玉琅玕。骨香腰细更沈檀。",
      "geLyuStr": "中仄中平中仄平中平中仄仄平平中平中仄仄平平中仄中平平仄仄中平中仄仄平平中平中仄仄平平",
      "rhymePos": [
        6,
        13,
        20,
        34,
        41
      ],
      "ciSep": [
        "宿醉离愁慢髻鬟",
        "六铢衣薄惹轻寒",
        "慵红闷翠掩青鸾",
        "罗袜况兼金菡萏　雪肌仍是玉琅玕",
        "骨香腰细更沈檀"
      ],
      "geLyuSep": [
        "中仄中平中仄平韵",
        "中平中仄仄平平韵",
        "中平中仄仄平平韵",
        "中仄中平平仄仄句中平中仄仄平平韵",
        "中平中仄仄平平韵"
      ]
    },
    {
      "tune": "浣溪沙",
      "origin": "红蓼渡头秋正雨，印沙鸥迹自成行。整鬟飘袖野风香。不语含颦深浦里，几回愁煞棹船郎。燕归帆尽水茫茫。",
      "geLyuStr": "平仄仄平平仄仄仄平平仄仄平平仄平平仄仄平平仄仄平平平仄仄仄平平仄仄平平仄平平仄仄平平",
      "rhymePos": [
        13,
        20,
        34,
        41
      ],
      "ciSep": [
        "红蓼渡头秋正雨　印沙鸥迹自成行",
        "整鬟飘袖野风香",
        "不语含颦深浦里　几回愁煞棹船郎",
        "燕归帆尽水茫茫"
      ],
      "geLyuSep": [
        "平仄仄平平仄仄句仄平平仄仄平平韵",
        "仄平平仄仄平平韵",
        "仄仄平平平仄仄句仄平平仄仄平平韵",
        "仄平平仄仄平平韵"
      ]
    },
    {
      "tune": "浣溪沙",
      "origin": "风撼芳菲满院香。四帘慵卷日初长。鬓云垂枕响微锽。春梦未成愁寂寂，佳期难会信茫茫。万般心，千点泪，泣兰堂。",
      "geLyuStr": "平仄平平仄仄平仄平平仄仄平平仄平平仄仄平平平仄仄平平仄仄平平平仄仄平平仄平平平仄仄仄平平",
      "rhymePos": [
        6,
        13,
        20,
        34,
        43
      ],
      "ciSep": [
        "风撼芳菲满院香",
        "四帘慵卷日初长",
        "鬓云垂枕响微锽",
        "春梦未成愁寂寂　佳期难会信茫茫",
        "万般心　千点泪　泣兰堂"
      ],
      "geLyuSep": [
        "平仄平平仄仄平韵",
        "仄平平仄仄平平韵",
        "仄平平仄仄平平韵",
        "平仄仄平平仄仄句平平平仄仄平平韵",
        "仄平平句平仄仄句仄平平韵"
      ]
    }
  ],
  "菩萨蛮": [
    {
      "tune": "菩萨蛮",
      "origin": "平林漠漠烟如织。寒山一带伤心碧。暝色入高楼。有人楼上愁。玉阶空伫立。宿鸟归飞急。何处是归程。长亭更短亭。",
      "geLyuStr": "中平中仄平平仄中平中仄平平仄中仄仄平平中平中仄平中平平仄仄中仄中平仄中仄仄平平中平中仄平",
      "rhymePos": [
        6,
        13,
        18,
        23,
        28,
        33,
        38,
        43
      ],
      "ciSep": [
        "平林漠漠烟如织",
        "寒山一带伤心碧",
        "暝色入高楼",
        "有人楼上愁",
        "玉阶空伫立",
        "宿鸟归飞急",
        "何处是归程",
        "长亭更短亭"
      ],
      "geLyuSep": [
        "中平中仄平平仄仄韵",
        "中平中仄平平仄韵",
        "中仄仄平平平韵",
        "中平中仄平韵",
        "中平平仄仄换仄韵",
        "中仄中平仄韵",
        "中仄仄平平换平韵",
        "中平中仄平韵"
      ]
    },
    {
      "tune": "菩萨蛮",
      "origin": "秋风乍起梧桐落。蛩吟唧唧添萧索。敧枕背灯眠。月和残梦圆。起来钩翠箔。何处寒砧作。独倚小阑干。逼人风露寒。",
      "geLyuStr": "平平仄仄平平仄平平仄仄平平仄平仄仄平平仄平平仄平仄平平仄仄平仄平平仄仄仄仄平平仄平平仄平",
      "rhymePos": [
        6,
        13,
        18,
        23,
        28,
        33,
        38,
        43
      ],
      "ciSep": [
        "秋风乍起梧桐落",
        "蛩吟唧唧添萧索",
        "敧枕背灯眠",
        "月和残梦圆",
        "起来钩翠箔",
        "何处寒砧作",
        "独倚小阑干",
        "逼人风露寒"
      ],
      "geLyuSep": [
        "平平仄仄平平仄仄韵",
        "平平仄仄平平仄韵",
        "平仄仄平平平韵",
        "仄平平仄平韵",
        "仄平平仄仄仄韵",
        "平仄平平仄韵",
        "仄仄仄平平平韵",
        "仄平平仄平韵"
      ]
    },
    {
      "tune": "菩萨蛮",
      "origin": "丝丝杨柳莺声近。晚风吹过秋千影。寒色一帘轻。灯残梦不成。耳边消息在。笑指花梢待。又是不归来。满庭花自开。",
      "geLyuStr": "平平平仄平平仄仄平平仄平平仄平仄仄平平平平仄仄平仄平平仄仄仄仄平平仄仄仄仄平平仄平平仄平",
      "rhymePos": [
        6,
        13,
        18,
        23,
        28,
        33,
        38,
        43
      ],
      "ciSep": [
        "丝丝杨柳莺声近",
        "晚风吹过秋千影",
        "寒色一帘轻",
        "灯残梦不成",
        "耳边消息在",
        "笑指花梢待",
        "又是不归来",
        "满庭花自开"
      ],
      "geLyuSep": [
        "平平平仄平平仄叶",
        "仄平平仄平平仄叶",
        "平仄仄平平韵",
        "平平仄仄平韵",
        "仄平平仄仄换叶",
        "仄仄平平仄叶",
        "仄仄仄平平韵",
        "仄平平仄平韵"
      ]
    }
  ],
  "卜算子": [
    {
      "tune": "卜算子",
      "origin": "缺月挂疏桐，漏断人初静。时见幽人独往来，缥缈孤鸿影。惊起却回头，有恨无人省。拣尽寒枝不肯栖，寂寞沙洲冷。",
      "geLyuStr": "中中中中平中仄平平仄中仄平平中中中中仄平平仄中中中中平中仄平平仄中仄平平中中中仄仄平平仄",
      "rhymePos": [
        9,
        21,
        31,
        43
      ],
      "ciSep": [
        "缺月挂疏桐　漏断人初静",
        "时见幽人独往来　缥缈孤鸿影",
        "惊起却回头　有恨无人省",
        "拣尽寒枝不肯栖　寂寞沙洲冷"
      ],
      "geLyuSep": [
        "中中中中平句中仄平平仄韵",
        "中仄平平中中中句中仄平平仄韵",
        "中中中中平句中仄平平仄韵",
        "中仄平平中中中句仄仄平平仄韵"
      ]
    },
    {
      "tune": "卜算子",
      "origin": "见也如何暮。别也如何遽。别也应难见也难，后会难凭据。去也如何去。住也如何住。住也应难去也难，此际难分付。",
      "geLyuStr": "仄仄平平仄仄仄平平仄仄仄平平仄仄平仄仄平平仄仄仄平平仄仄仄平平仄仄仄平平仄仄平仄仄平平仄",
      "rhymePos": [
        4,
        9,
        21,
        26,
        31,
        43
      ],
      "ciSep": [
        "见也如何暮",
        "别也如何遽",
        "别也应难见也难　后会难凭据",
        "去也如何去",
        "住也如何住",
        "住也应难去也难　此际难分付"
      ],
      "geLyuSep": [
        "仄仄平平仄韵",
        "仄仄平平仄韵",
        "仄仄平平仄仄平句仄仄平平仄韵",
        "仄仄平平仄韵",
        "仄仄平平仄韵",
        "仄仄平平仄仄平句仄仄平平仄韵"
      ]
    },
    {
      "tune": "卜算子",
      "origin": "胸中千种愁，挂在斜阳树。绿叶阴阴自得春，草满莺啼处。不见凌波步。空想如簧语。门外重重叠叠山，遮不断、愁来路。",
      "geLyuStr": "平平平仄平仄仄平平仄仄仄平平仄仄平仄仄平平仄仄仄平平仄平仄平平仄平仄平平仄仄平平仄仄平平仄",
      "rhymePos": [
        9,
        21,
        26,
        31,
        44
      ],
      "ciSep": [
        "胸中千种愁　挂在斜阳树",
        "绿叶阴阴自得春　草满莺啼处",
        "不见凌波步",
        "空想如簧语",
        "门外重重叠叠山　遮不断　愁来路"
      ],
      "geLyuSep": [
        "平平平仄平句仄仄平平仄韵",
        "仄仄平平仄仄平句仄仄平平仄韵",
        "仄仄平平仄韵",
        "平仄平平仄韵",
        "平仄平平仄仄平句平仄仄读平平仄韵"
      ]
    }
  ],
  "蝶恋花": [
    {
      "tune": "蝶恋花",
      "origin": "六曲阑干偎碧树。杨柳风轻，展尽黄金缕。谁把钿筝移玉柱。穿帘海燕双飞去。满眼游丝兼落絮。红杏开时，一霎清明雨。浓睡觉来莺乱语。惊残好梦无寻处。",
      "geLyuStr": "中仄中平平仄仄中仄平平中仄平平仄中仄中平平仄仄中平中仄平平仄中仄中平平仄仄中仄平平中仄平平仄中仄中平平仄仄中平中仄平平仄",
      "rhymePos": [
        6,
        15,
        22,
        29,
        36,
        45,
        52,
        59
      ],
      "ciSep": [
        "六曲阑干偎碧树",
        "杨柳风轻　展尽黄金缕",
        "谁把钿筝移玉柱",
        "穿帘海燕双飞去",
        "满眼游丝兼落絮",
        "红杏开时　一霎清明雨",
        "浓睡觉来莺乱语",
        "惊残好梦无寻处"
      ],
      "geLyuSep": [
        "中仄中平平仄仄韵",
        "中仄平平句中仄平平仄韵",
        "中仄中平平仄仄韵",
        "中平中仄平平仄韵",
        "中仄中平平仄仄韵",
        "中仄平平句中仄平平仄韵",
        "中仄中平平仄仄韵",
        "中平中仄平平仄韵"
      ]
    },
    {
      "tune": "蝶恋花",
      "origin": "渐近朱门香夹道。一片笙歌，依约楼台杪。野色和烟满芳草。溪光曲曲山回抱。物华不逐人间老。日日春风，在处花枝好。莫恨云深路难到。刘郎可惜归来早。",
      "geLyuStr": "中仄平平平仄仄中仄平平中仄平平仄中仄平平仄平仄中平中仄平平仄中平中仄平平仄中仄平平仄仄平平仄中仄中平中平仄中平中仄平平仄",
      "rhymePos": [
        6,
        15,
        22,
        29,
        36,
        45,
        52,
        59
      ],
      "ciSep": [
        "渐近朱门香夹道",
        "一片笙歌　依约楼台杪",
        "野色和烟满芳草",
        "溪光曲曲山回抱",
        "物华不逐人间老",
        "日日春风　在处花枝好",
        "莫恨云深路难到",
        "刘郎可惜归来早"
      ],
      "geLyuSep": [
        "中仄平平平仄仄韵",
        "中仄平平句中仄平平仄韵",
        "中仄平平仄平仄韵",
        "中平中仄平平仄韵",
        "中平中仄平平仄韵",
        "中仄平平句仄仄平平仄韵",
        "中仄中平中平仄韵",
        "中平中仄平平仄韵"
      ]
    },
    {
      "tune": "蝶恋花",
      "origin": "别来相思无限期。欲说相思，要见终无计。拟写相思持送伊。如何尽得相思意。眼底相思心里事。纵把相思，写尽凭谁寄。多少相思都做泪。一齐泪损相思字。",
      "geLyuStr": "仄平平平平仄平仄仄平平仄仄平平仄仄仄平平平仄平平平仄仄平平仄仄仄平平平仄仄仄仄平平仄仄平平仄平仄平平平仄仄仄平仄仄平平仄",
      "rhymePos": [
        6,
        15,
        22,
        29,
        36,
        45,
        52,
        59
      ],
      "ciSep": [
        "别来相思无限期",
        "欲说相思　要见终无计",
        "拟写相思持送伊",
        "如何尽得相思意",
        "眼底相思心里事",
        "纵把相思　写尽凭谁寄",
        "多少相思都做泪",
        "一齐泪损相思字"
      ],
      "geLyuSep": [
        "仄平平平平仄平叶",
        "仄仄平平句仄仄平平仄韵",
        "仄仄平平平仄平叶",
        "平平仄仄平平仄韵",
        "仄仄平平平仄仄韵",
        "仄仄平平句仄仄平平仄韵",
        "平仄平平平仄仄韵",
        "仄平仄仄平平仄韵"
      ]
    }
  ],
  "水调歌头": [
    {
      "tune": "水调歌头",
      "origin": "九金增宋重，八玉变秦馀。千年清浸，先净河洛出图书。一段升平光景，不但五星循轨，万点共连珠。垂衣本神圣，补衮妙工夫。朝元去，锵环佩，冷云衢。芝房雅奏，仪凤矫首听笙竽。天近黄麾仗晓，春早红鸾扇暖，迟日上金铺。万岁南山色，不老对唐虞。",
      "geLyuStr": "中中中中仄中仄仄平平中平平仄中中平仄仄平平中仄中平中仄中仄中平中仄中仄仄平平中中中平仄中仄仄平平中中中中中仄仄中平中平中仄中仄中仄仄平平中仄中平中仄中仄中平中仄中仄仄平平中仄中平仄中仄仄平平",
      "rhymePos": [
        9,
        20,
        37,
        47,
        56,
        67,
        84,
        94
      ],
      "ciSep": [
        "九金增宋重　八玉变秦馀",
        "千年清浸　先净河洛出图书",
        "一段升平光景　不但五星循轨　万点共连珠",
        "垂衣本神圣　补衮妙工夫",
        "朝元去　锵环佩　冷云衢",
        "芝房雅奏　仪凤矫首听笙竽",
        "天近黄麾仗晓　春早红鸾扇暖　迟日上金铺",
        "万岁南山色　不老对唐虞"
      ],
      "geLyuSep": [
        "中中中中仄句中仄仄平平韵",
        "中平平仄句中中平仄仄平平韵",
        "中仄中平中仄句中仄中平中仄句中仄仄平平韵",
        "中中中平仄句中仄仄平平韵",
        "中中中句中中仄句仄中平韵",
        "中平中仄句中仄中仄仄平平韵",
        "中仄中平中仄句中仄中平中仄句中仄仄平平韵",
        "中仄中平仄句中仄仄平平韵"
      ]
    },
    {
      "tune": "水调歌头",
      "origin": "岁晚念行役，江阔渺风烟。六朝文物何在，回首更凄然。倚尽危楼杰观，暗想琼枝璧月，罗袜步承莲。桃叶山前鹭，无语下寒滩。潮寂寞，浸孤垒，涨平川。莫愁艇子何处，烟树杳无边。王谢堂前双燕，空绕乌衣门巷，斜日草连天。只有台城月，千古照婵娟。",
      "geLyuStr": "仄仄仄平仄平仄仄平平仄平平仄平仄平仄仄平平仄仄平平仄仄仄仄平平仄仄平仄仄平平平仄平平仄平仄仄平平平仄仄仄平仄仄平平仄平仄仄平仄平仄仄平平平仄平平平仄平仄平平平仄平仄仄平平仄仄平平仄平仄仄平平",
      "rhymePos": [
        9,
        20,
        37,
        47,
        56,
        67,
        84,
        94
      ],
      "ciSep": [
        "岁晚念行役　江阔渺风烟",
        "六朝文物何在　回首更凄然",
        "倚尽危楼杰观　暗想琼枝璧月　罗袜步承莲",
        "桃叶山前鹭　无语下寒滩",
        "潮寂寞　浸孤垒　涨平川",
        "莫愁艇子何处　烟树杳无边",
        "王谢堂前双燕　空绕乌衣门巷　斜日草连天",
        "只有台城月　千古照婵娟"
      ],
      "geLyuSep": [
        "仄仄仄平仄句平仄仄平平韵",
        "仄平平仄平仄句平仄仄平平韵",
        "仄仄平平仄仄句仄仄平平仄仄句平仄仄平平韵",
        "平仄平平仄句平仄仄平平韵",
        "平仄仄句仄平仄句仄平平韵",
        "仄平仄仄平仄句平仄仄平平韵",
        "平仄平平平仄句平仄平平平仄句平仄仄平平韵",
        "仄仄平平仄句平仄仄平平韵"
      ]
    },
    {
      "tune": "水调歌头",
      "origin": "明月几时有，把酒问青天。不知天上宫阙，今夕是何年。我欲乘风归去。又恐琼楼玉宇。高处不胜寒。起舞弄清影，何似在人间。转朱阁，低绮户，照无眠。不应有恨，何事长向别时圆。人有悲欢离合。月有阴晴圆缺。此事古难全。但愿人长久，千里共婵娟。",
      "geLyuStr": "平仄仄平仄仄仄仄平平仄平平仄平仄平仄仄平平仄仄平平平仄仄仄平平仄仄平仄仄平平仄仄仄平仄平仄仄平平仄平仄平仄仄仄平平仄平仄仄平仄平仄仄平平平仄平平平仄仄仄平平平仄仄仄仄平平仄仄平平仄平仄仄平平",
      "rhymePos": [
        9,
        20,
        26,
        32,
        37,
        47,
        56,
        67,
        73,
        79,
        84,
        94
      ],
      "ciSep": [
        "明月几时有　把酒问青天",
        "不知天上宫阙　今夕是何年",
        "我欲乘风归去",
        "又恐琼楼玉宇",
        "高处不胜寒",
        "起舞弄清影　何似在人间",
        "转朱阁　低绮户　照无眠",
        "不应有恨　何事长向别时圆",
        "人有悲欢离合",
        "月有阴晴圆缺",
        "此事古难全",
        "但愿人长久　千里共婵娟"
      ],
      "geLyuSep": [
        "平仄仄平仄句仄仄仄平平平韵",
        "仄平平仄平仄句平仄仄平平韵",
        "仄仄平平平仄仄韵",
        "仄仄平平仄仄韵",
        "平仄仄平平平韵",
        "仄仄仄平仄句平仄仄平平韵",
        "仄平仄句平仄仄句仄平平韵",
        "仄平仄仄句平仄平仄仄平平韵",
        "平仄平平平仄换仄韵",
        "仄仄平平平仄韵",
        "仄仄仄平平平韵",
        "仄仄平平仄句平仄仄平平韵"
      ]
    }
  ],
  "念奴娇": [
    {
      "tune": "念奴娇",
      "origin": "凭空眺远，见长空万里，云无留迹。桂魄飞来光射处，冷浸一天秋碧。玉宇琼楼，乘鸾来去，人在清凉国。江山如画，望中烟树历历。我醉拍手狂歌，举杯邀月，对影成三客。起舞徘徊风露下，今夕不知何夕。便欲乘风，翻然归去，何用骑鹏翼。水晶宫里，一声吹断横笛。",
      "geLyuStr": "中平中仄仄中平中仄中中平仄中仄中平平仄仄中仄中平平仄中仄平平中平中仄中仄平平仄中平平仄仄平平仄中仄中仄中仄平平中平中仄中中平平仄中仄中平平仄仄中仄中平平仄中仄平平中平中仄中仄平平仄中平平仄中平平仄平仄",
      "rhymePos": [
        12,
        25,
        38,
        48,
        63,
        76,
        89,
        99
      ],
      "ciSep": [
        "凭空眺远　见长空万里　云无留迹",
        "桂魄飞来光射处　冷浸一天秋碧",
        "玉宇琼楼　乘鸾来去　人在清凉国",
        "江山如画　望中烟树历历",
        "我醉拍手狂歌　举杯邀月　对影成三客",
        "起舞徘徊风露下　今夕不知何夕",
        "便欲乘风　翻然归去　何用骑鹏翼",
        "水晶宫里　一声吹断横笛"
      ],
      "geLyuSep": [
        "中平中仄句仄中平中仄句中中平仄韵",
        "中仄中平平仄仄句中仄中平平仄韵",
        "中仄平平句中平中仄句中仄平平仄韵",
        "中平平仄句仄平平仄中仄韵",
        "中仄中仄平平句中平中仄句中中平平仄韵",
        "中仄中平平仄仄句中仄中平平仄韵",
        "中仄平平句中平中仄句中仄平平仄韵",
        "中平平仄句中平平仄平仄韵"
      ]
    },
    {
      "tune": "念奴娇",
      "origin": "大江东去，浪淘尽、千古风流人物。故垒西边，人道是、三国周郎赤壁。乱石穿空，惊涛拍岸，卷起千堆雪。江山如画，一时多少豪杰。遥想公瑾当年，小乔初嫁了，雄姿英发。羽扇纶巾，谈笑处、樯橹灰飞烟灭。故国神游，多情应笑我，早生华发。人间如寄，一尊还酹江月。",
      "geLyuStr": "仄平平仄仄平仄平仄平平平仄仄仄平平平仄仄平仄平平仄仄仄仄平平平平仄仄仄仄平平仄平平平仄仄平平仄平仄平仄平仄平平仄平平仄仄平平平仄仄仄平平平仄仄平仄平平平仄仄仄平平平平仄仄仄仄平平仄平平平仄仄平平仄平仄",
      "rhymePos": [
        12,
        25,
        38,
        48,
        63,
        76,
        89,
        99
      ],
      "ciSep": [
        "大江东去　浪淘尽　千古风流人物",
        "故垒西边　人道是　三国周郎赤壁",
        "乱石穿空　惊涛拍岸　卷起千堆雪",
        "江山如画　一时多少豪杰",
        "遥想公瑾当年　小乔初嫁了　雄姿英发",
        "羽扇纶巾　谈笑处　樯橹灰飞烟灭",
        "故国神游　多情应笑我　早生华发",
        "人间如寄　一尊还酹江月"
      ],
      "geLyuSep": [
        "仄平平仄句仄平仄读平仄平平平仄韵",
        "仄仄平平句平仄仄读平仄平平仄仄韵",
        "仄仄平平句平平仄仄句仄仄平平仄韵",
        "平平平仄句仄平平仄平仄韵",
        "平仄平仄平平句仄平平仄仄句平平平仄韵",
        "仄仄平平句平仄仄读平仄平平平仄韵",
        "仄仄平平句平平仄仄仄句仄平平仄韵",
        "平平平仄句仄平平仄平仄韵"
      ]
    },
    {
      "tune": "念奴娇",
      "origin": "五湖旧约，问经年底事，长负清景。暝入西山，渐唤我、一叶夷犹乘兴。倦网都收，归禽时度，月上汀洲冷。中流容与，画桡不点清镜。谁解唤起湘灵，烟鬟雾鬓，理哀弦鸿阵。玉麈清谈，叹坐客、多少风流名胜。暗柳萧萧，飞萤冉冉，夜久知秋信。鲈鱼应好，旧家乐事谁省。",
      "geLyuStr": "仄平仄仄仄平平仄仄平仄平仄仄仄平平仄仄仄仄仄平平平仄仄仄平平平平平仄仄仄平平仄平平平仄仄平仄仄平仄平仄仄仄平平平平仄仄仄平平平仄仄仄平平仄仄仄平仄平平平仄仄仄平平平平仄仄仄仄平平仄平平平仄仄平仄仄平仄",
      "rhymePos": [
        12,
        25,
        38,
        48,
        63,
        76,
        89,
        99
      ],
      "ciSep": [
        "五湖旧约　问经年底事　长负清景",
        "暝入西山　渐唤我　一叶夷犹乘兴",
        "倦网都收　归禽时度　月上汀洲冷",
        "中流容与　画桡不点清镜",
        "谁解唤起湘灵　烟鬟雾鬓　理哀弦鸿阵",
        "玉麈清谈　叹坐客　多少风流名胜",
        "暗柳萧萧　飞萤冉冉　夜久知秋信",
        "鲈鱼应好　旧家乐事谁省"
      ],
      "geLyuSep": [
        "仄平仄仄句仄平平仄仄句平仄平仄韵",
        "仄仄平平句仄仄仄读仄仄平平平仄韵",
        "仄仄平平句平平平仄句仄仄平平仄韵",
        "平平平仄句仄平仄仄平仄韵",
        "平仄仄仄平平句平平仄仄句仄平平平仄韵",
        "仄仄平平句仄仄仄读平仄平平平仄韵",
        "仄仄平平句平平仄仄句仄仄平平仄韵",
        "平平平仄句仄平仄仄平仄韵"
      ]
    }
  ],
  "雨霖铃": [
    {
      "tune": "雨霖铃",
      "origin": "寒蝉凄切。对长亭晚，骤雨初歇。都门帐饮无绪，方留恋处，兰舟催发。执手相看泪眼，竟无语凝咽。念去去、千里烟波，暮霭沈沈楚天阔。多情自古伤离别。更那堪、冷落清秋节。今宵酒醒何处，杨柳岸、晓风残月。此去经年，应是良辰，好景虚设。便纵有、千种风情，更与何人说。",
      "geLyuStr": "平平中仄仄平平仄仄仄平仄平平中中中仄平平仄仄平平平仄仄仄平平中仄仄平中平仄仄仄中平仄平平仄仄平平仄平仄中平仄仄平平仄仄平平仄仄平平仄中平仄中中仄中仄仄仄平平仄仄仄平平平仄平平仄中平仄仄仄仄中仄平平仄仄平平仄",
      "rhymePos": [
        3,
        11,
        25,
        36,
        50,
        57,
        65,
        78,
        90,
        102
      ],
      "ciSep": [
        "寒蝉凄切",
        "对长亭晚　骤雨初歇",
        "都门帐饮无绪　方留恋处　兰舟催发",
        "执手相看泪眼　竟无语凝咽",
        "念去去　千里烟波　暮霭沈沈楚天阔",
        "多情自古伤离别",
        "更那堪　冷落清秋节",
        "今宵酒醒何处　杨柳岸　晓风残月",
        "此去经年　应是良辰　好景虚设",
        "便纵有　千种风情　更与何人说"
      ],
      "geLyuSep": [
        "平平中仄韵",
        "仄平平仄句仄仄平仄韵",
        "平平中中中仄句平平仄仄句平平平仄韵",
        "仄仄平平中仄句仄平中平仄韵",
        "仄仄中读平仄平平句仄仄平平仄平仄韵",
        "中平仄仄平平仄韵",
        "仄平平读仄仄平平仄韵",
        "中平仄中中仄句中仄仄读仄平平仄韵",
        "仄仄平平句平仄平平句仄中平仄韵",
        "仄仄仄读中仄平平句仄仄平平仄韵"
      ]
    },
    {
      "tune": "雨霖铃",
      "origin": "琼楼玉宇。满人寰、似海边洲渚。蓬莱又还水浅，鲸涛静见，银宫如许。紫极鸣箫声断，望霓舟何处。待夜深、重倚层霄，认得瑶池广寒路。郢中旧曲谁能度。恨歌声、响入青云去。西湖近时绝唱，总不道、月梅盐絮。暗想当年，宾从毫端，有惊人句。漫说向、枚叟邹生，共作梁园赋。",
      "geLyuStr": "平平仄仄仄平平仄仄平平仄平平仄平仄仄平平仄仄平平平仄仄仄平平平仄仄平平平仄仄仄平平仄平平仄仄平平仄平仄仄平仄仄平平仄仄平平仄仄平平仄平平仄平仄仄仄仄仄仄平平仄仄仄平平平仄平平仄平平仄仄仄仄平仄平平仄仄平平仄",
      "rhymePos": [
        3,
        11,
        25,
        36,
        50,
        57,
        65,
        78,
        90,
        102
      ],
      "ciSep": [
        "琼楼玉宇",
        "满人寰　似海边洲渚",
        "蓬莱又还水浅　鲸涛静见　银宫如许",
        "紫极鸣箫声断　望霓舟何处",
        "待夜深　重倚层霄　认得瑶池广寒路",
        "郢中旧曲谁能度",
        "恨歌声　响入青云去",
        "西湖近时绝唱　总不道　月梅盐絮",
        "暗想当年　宾从毫端　有惊人句",
        "漫说向　枚叟邹生　共作梁园赋"
      ],
      "geLyuSep": [
        "平平仄仄韵",
        "仄平平读仄仄平平仄韵",
        "平平仄平仄仄句平平仄仄句平平平仄韵",
        "仄仄平平平仄句仄平平平仄韵",
        "仄仄平读平仄平平句仄仄平平仄平仄韵",
        "仄平仄仄平平仄韵",
        "仄平平读仄仄平平仄韵",
        "平平仄平仄仄句仄仄仄读仄平平仄韵",
        "仄仄平平句平仄平平句仄平平仄韵",
        "仄仄仄读平仄平平句仄仄平平仄韵"
      ]
    },
    {
      "tune": "雨霖铃",
      "origin": "天南游客。甚而今、却送君南国。西风万里无限，吟蝉暗续，离情如织。秣马脂车，去即去、多少人惜。望百里、烟惨云山，送两程、愁作行色。飞帆过浙西封域。到秋深、且舣荷花泽。就船买得鲈鳜，新谷破、雪堆香粒。此兴谁同，须记东秦，有客相忆。愿听了、一阙歌声，醉倒拌今日。",
      "geLyuStr": "平平平仄仄平平仄仄平平仄平平仄仄平仄平平仄仄平平平仄仄仄平平仄仄仄平仄平仄仄仄仄平仄平平仄仄平平仄平仄平平仄仄平平仄仄平平仄仄平平仄仄平仄仄平仄平仄仄仄平平仄仄仄平平平仄平平仄仄平仄仄仄仄仄仄平平仄仄平平仄",
      "rhymePos": [
        3,
        11,
        25,
        36,
        50,
        57,
        65,
        78,
        90,
        102
      ],
      "ciSep": [
        "天南游客",
        "甚而今　却送君南国",
        "西风万里无限　吟蝉暗续　离情如织",
        "秣马脂车　去即去　多少人惜",
        "望百里　烟惨云山　送两程　愁作行色",
        "飞帆过浙西封域",
        "到秋深　且舣荷花泽",
        "就船买得鲈鳜　新谷破　雪堆香粒",
        "此兴谁同　须记东秦　有客相忆",
        "愿听了　一阙歌声　醉倒拌今日"
      ],
      "geLyuSep": [
        "平平平仄韵",
        "仄平平读仄仄平平仄韵",
        "平平仄仄平仄句平平仄仄句平平平仄韵",
        "仄仄平平句仄仄仄读平仄平仄韵",
        "仄仄仄读平仄平平句仄仄平读平仄平仄韵",
        "平平仄仄平平仄韵",
        "仄平平读仄仄平平仄韵",
        "仄平仄仄平仄句平仄仄读仄平平仄韵",
        "仄仄平平句平仄平平句仄仄平仄韵",
        "仄仄仄读仄仄平平句仄仄平平仄韵"
      ]
    }
  ],
  "满江红": [
    {
      "tune": "满江红",
      "origin": "暮雨初收，长川静、征帆夜落。临岛屿、蓼烟疏淡，苇风萧索。几许渔人横短艇，尽将灯火归村落。遣行客、当此念回程，伤漂泊。桐江好，烟漠漠。波似染，山如削。绕严陵滩畔，鹭飞鱼跃。游宦区区成底事，平生况有云泉约。归去来、一曲仲宣吟，从军乐。",
      "geLyuStr": "中仄平平中中仄中平中仄中中中中平中仄中平平仄中仄中平平仄仄中平中仄平平仄仄中中中仄仄平平平平仄平中仄平中仄平中仄平平仄中中中中中中中平仄中仄中平平仄仄中平中仄平平仄中中中中仄仄平平平平仄",
      "rhymePos": [
        10,
        21,
        35,
        46,
        52,
        58,
        67,
        81,
        92
      ],
      "ciSep": [
        "暮雨初收　长川静　征帆夜落",
        "临岛屿　蓼烟疏淡　苇风萧索",
        "几许渔人横短艇　尽将灯火归村落",
        "遣行客　当此念回程　伤漂泊",
        "桐江好　烟漠漠",
        "波似染　山如削",
        "绕严陵滩畔　鹭飞鱼跃",
        "游宦区区成底事　平生况有云泉约",
        "归去来　一曲仲宣吟　从军乐"
      ],
      "geLyuSep": [
        "中仄平平句中中仄读中平中仄韵",
        "中中中读中平中仄句中平平仄韵",
        "中仄中平平仄仄句中平中仄平平仄韵",
        "仄中中读中仄仄平平句平平仄韵",
        "平中仄句平中仄韵",
        "平中仄句平平仄韵",
        "中中中中中句中中平仄韵",
        "中仄中平平仄仄句中平中仄平平仄韵",
        "中中中读中仄仄平平句平平仄韵"
      ]
    },
    {
      "tune": "满江红",
      "origin": "春水连天，桃花浪、几番风恶。云乍起、远山遮尽，晚风还作。绿遍芳洲生杜若。楚帆带雨烟中落。认向来、沙觜共停桡，伤飘泊。寒犹在，衾偏薄。肠欲断，愁难著。倚篷窗无寐，引杯孤酌。寒食清明都过却。可怜辜负年时约。想小楼、日日望归舟，人如削。",
      "geLyuStr": "平仄平平平平仄仄平平仄平仄仄仄平平仄仄平平仄仄仄平平平仄仄仄平仄仄平平仄仄仄平平仄仄平平平平仄平平仄平平仄平仄仄平平仄仄平平平仄仄平平仄平仄平平平仄仄仄平平仄平平仄仄仄平仄仄仄平平平平仄",
      "rhymePos": [
        10,
        21,
        28,
        35,
        46,
        52,
        58,
        67,
        74,
        81,
        92
      ],
      "ciSep": [
        "春水连天　桃花浪　几番风恶",
        "云乍起　远山遮尽　晚风还作",
        "绿遍芳洲生杜若",
        "楚帆带雨烟中落",
        "认向来　沙觜共停桡　伤飘泊",
        "寒犹在　衾偏薄",
        "肠欲断　愁难著",
        "倚篷窗无寐　引杯孤酌",
        "寒食清明都过却",
        "可怜辜负年时约",
        "想小楼　日日望归舟　人如削"
      ],
      "geLyuSep": [
        "平仄平平句平平仄读仄平平仄韵",
        "平仄仄读仄平平仄句仄平平仄韵",
        "仄仄平平平仄仄韵",
        "仄平仄仄平平仄韵",
        "仄仄平读平仄仄平平句平平仄韵",
        "平平仄句平平仄韵",
        "平仄仄句平平仄韵",
        "仄平平平仄句仄平平仄韵",
        "平仄平平平仄仄韵",
        "仄平平仄平平仄韵",
        "仄仄平读仄仄仄平平句平平仄韵"
      ]
    },
    {
      "tune": "满江红",
      "origin": "赤壁矶头，一番过、一番怀古。想当时、周郎年少，气吞区宇。万骑临江貔虎噪，千艘列炬鱼龙怒。卷长波、一鼓困曹瞒，今如许。江上渡。江边路。形胜地，兴亡处。览遗踪，胜读史书言语。几度东风吹世换，千年往事随潮去。问道傍、杨柳为谁春，摇金缕。",
      "geLyuStr": "仄仄平平仄平仄仄平平仄仄平平平平平仄仄平平仄仄仄平平平仄仄平平仄仄平平仄仄平平仄仄仄平平平平仄平仄仄平平仄平仄仄平平仄仄平平仄仄仄平平仄仄仄平平平仄仄平平仄仄平平仄仄仄平平仄仄平平平平仄",
      "rhymePos": [
        10,
        21,
        35,
        46,
        49,
        52,
        58,
        67,
        81,
        92
      ],
      "ciSep": [
        "赤壁矶头　一番过　一番怀古",
        "想当时　周郎年少　气吞区宇",
        "万骑临江貔虎噪　千艘列炬鱼龙怒",
        "卷长波　一鼓困曹瞒　今如许",
        "江上渡",
        "江边路",
        "形胜地　兴亡处",
        "览遗踪　胜读史书言语",
        "几度东风吹世换　千年往事随潮去",
        "问道傍　杨柳为谁春　摇金缕"
      ],
      "geLyuSep": [
        "仄仄平平句仄平仄读仄平平仄韵",
        "仄平平读平平平仄句仄平平仄韵",
        "仄仄平平平仄仄句平平仄仄平平仄韵",
        "仄平平读仄仄仄平平句平平仄韵",
        "平仄仄韵",
        "平平仄韵",
        "平仄仄句平平仄韵",
        "仄平平句仄仄仄平平仄韵",
        "仄仄平平平仄仄句平平仄仄平平仄韵",
        "仄仄平读平仄仄平平句平平仄韵"
      ]
    }
  ],
  "青玉案": [
    {
      "tune": "青玉案",
      "origin": "凌波不过横塘路。但目送、芳尘去。锦瑟年华谁与度。月楼花院，绮窗朱户。惟有春知处。碧云冉冉蘅皋暮。彩笔空题断肠句。试问閒愁知几许。一川烟草，满城风絮。梅子黄时雨。",
      "geLyuStr": "中平中仄平平仄仄中仄平平仄中仄中平平仄仄中平中仄中平中仄中仄平平仄中平中仄平平仄中仄平平仄平仄中仄中平平仄仄中平中仄中平中仄中仄平平仄",
      "rhymePos": [
        6,
        12,
        19,
        27,
        32,
        39,
        46,
        53,
        61,
        66
      ],
      "ciSep": [
        "凌波不过横塘路",
        "但目送　芳尘去",
        "锦瑟年华谁与度",
        "月楼花院　绮窗朱户",
        "惟有春知处",
        "碧云冉冉蘅皋暮",
        "彩笔空题断肠句",
        "试问閒愁知几许",
        "一川烟草　满城风絮",
        "梅子黄时雨"
      ],
      "geLyuSep": [
        "中平中仄平平仄韵",
        "仄中仄读平平仄韵",
        "中仄中平平仄仄韵",
        "中平中仄句中平中仄韵",
        "中仄平平仄韵",
        "中平中仄平平仄韵",
        "中仄平平仄平仄韵",
        "中仄中平平仄仄韵",
        "中平中仄句中平中仄韵",
        "中仄平平仄韵"
      ]
    },
    {
      "tune": "青玉案",
      "origin": "三年枕上吴中路。谴黄耳、随君去。若到松江呼小渡。莫惊鸥鹭，四桥尽是，老子经行处。辋川图上看春暮。常记高人右丞句。作个归期天已许。春衫犹是，小蛮针线，曾湿西湖雨。",
      "geLyuStr": "平平仄仄平平仄仄平仄平平仄仄仄平平平仄仄仄平平仄仄平仄仄仄仄平平仄仄平平仄平平仄平仄平平仄平仄仄仄平平平仄仄平平平仄仄平平仄平仄平平仄",
      "rhymePos": [
        6,
        12,
        19,
        32,
        39,
        46,
        53,
        66
      ],
      "ciSep": [
        "三年枕上吴中路",
        "谴黄耳　随君去",
        "若到松江呼小渡",
        "莫惊鸥鹭　四桥尽是　老子经行处",
        "辋川图上看春暮",
        "常记高人右丞句",
        "作个归期天已许",
        "春衫犹是　小蛮针线　曾湿西湖雨"
      ],
      "geLyuSep": [
        "平平仄仄平平仄韵",
        "仄平仄读平平仄韵",
        "仄仄平平平仄仄韵",
        "仄平平仄句仄平仄仄句仄仄平平仄韵",
        "仄平平仄平平仄韵",
        "平仄平平仄平仄韵",
        "仄仄平平平仄仄韵",
        "平平平仄句仄平平仄句平仄平平仄韵"
      ]
    },
    {
      "tune": "青玉案",
      "origin": "杨花尽教难拘管。也解趁、飞红伴。骢马无情人渐远。沙平浅渡，雨湿孤村，何处长亭晚。欲凭桃叶传春怨。莫不似、斜风倩双燕。纵得书来春又换。只将心事，分付眉尖，寂寞梨花院。",
      "geLyuStr": "平平仄仄平平仄仄仄仄平平仄平仄平平平仄仄平平仄仄仄仄平平平仄平平仄仄平平仄平平仄仄仄仄平平仄平仄仄仄平平平仄仄仄平平仄平仄平平仄仄平平仄",
      "rhymePos": [
        6,
        12,
        19,
        32,
        39,
        47,
        54,
        67
      ],
      "ciSep": [
        "杨花尽教难拘管",
        "也解趁　飞红伴",
        "骢马无情人渐远",
        "沙平浅渡　雨湿孤村　何处长亭晚",
        "欲凭桃叶传春怨",
        "莫不似　斜风倩双燕",
        "纵得书来春又换",
        "只将心事　分付眉尖　寂寞梨花院"
      ],
      "geLyuSep": [
        "平平仄仄平平仄韵",
        "仄仄仄读平平仄韵",
        "平仄平平平仄仄韵",
        "平平仄仄句仄仄平平句平仄平平仄韵",
        "仄平平仄平平仄韵",
        "仄仄仄读平平仄平仄韵",
        "仄仄平平平仄仄韵",
        "仄平平仄句平仄平平句仄仄平平仄韵"
      ]
    }
  ],
  "沁园春": [
    {
      "tune": "沁园春",
      "origin": "孤馆灯青，野店鸡号，旅枕梦残。渐月华收练，晨霜耿耿，云山摛锦，朝露漙漙。世路无穷，劳生有限，似此区区长鲜欢。微吟罢，凭征鞍无语，往事千端。当时共客长安。似二陆、初来俱少年。有笔头千字，胸中万卷，致君尧舜，此事何难。用舍由时，行藏在我，袖手何妨閒处看。身长健，但优游卒岁，且斗尊前。",
      "geLyuStr": "中中平平中中中中中中中平仄中平中仄中平中仄中平中仄中仄平平中仄平平中平中仄中仄平平中仄平中平仄中中平中仄中仄平平中平中仄平平中中仄中平中仄平仄中平中仄中平中仄中平中仄中仄平平中仄平平中平中仄中仄平平中仄平中中仄仄中平中仄中仄平平",
      "rhymePos": [
        11,
        28,
        43,
        55,
        61,
        69,
        86,
        101,
        113
      ],
      "ciSep": [
        "孤馆灯青　野店鸡号　旅枕梦残",
        "渐月华收练　晨霜耿耿　云山摛锦　朝露漙漙",
        "世路无穷　劳生有限　似此区区长鲜欢",
        "微吟罢　凭征鞍无语　往事千端",
        "当时共客长安",
        "似二陆　初来俱少年",
        "有笔头千字　胸中万卷　致君尧舜　此事何难",
        "用舍由时　行藏在我　袖手何妨閒处看",
        "身长健　但优游卒岁　且斗尊前"
      ],
      "geLyuSep": [
        "中中平平句中中中中句中中中平韵",
        "仄中平中仄句中平中仄句中平中仄句中仄平平韵",
        "中仄平平句中平中仄句中仄平平中仄平韵",
        "中平仄句中中平中仄句中仄平平韵",
        "中平中仄平平韵",
        "中中仄读中平中仄平韵",
        "仄中平中仄句中平中仄句中平中仄句中仄平平韵",
        "中仄平平句中平中仄句中仄平平中仄平韵",
        "中中仄句仄中平中仄句中仄平平韵"
      ]
    },
    {
      "tune": "沁园春",
      "origin": "宫烛分烟，禁池开钥，凤城暮春。向落花香里，澄波影外，笙歌迟日，罗绮芳尘。载酒追游，联镳归晚，灯火平康寻梦云。逢迎处，最多才自负，巧笑相亲。离群。客宦漳滨。但惊见、来鸿归燕频。念日边消耗，天涯怅望，楼台清晓，帘幕黄昏。无限悲凉，不胜憔悴，断尽危肠销尽魂。方年少，恨浮名误我，乐事输人。",
      "geLyuStr": "平仄平平仄平平仄仄平仄平仄仄平平仄平平仄仄平平平仄平仄平平仄仄平平平平平仄平仄平平平仄平平平仄仄平平仄仄仄仄平平平平仄仄平平仄平仄平平平仄平仄仄平平仄平平仄仄平平平仄平仄平平平仄平平仄平平仄仄仄平平平仄平平平仄仄平平仄仄仄仄平平",
      "rhymePos": [
        11,
        28,
        43,
        55,
        57,
        61,
        69,
        86,
        101,
        113
      ],
      "ciSep": [
        "宫烛分烟　禁池开钥　凤城暮春",
        "向落花香里　澄波影外　笙歌迟日　罗绮芳尘",
        "载酒追游　联镳归晚　灯火平康寻梦云",
        "逢迎处　最多才自负　巧笑相亲",
        "离群",
        "客宦漳滨",
        "但惊见　来鸿归燕频",
        "念日边消耗　天涯怅望　楼台清晓　帘幕黄昏",
        "无限悲凉　不胜憔悴　断尽危肠销尽魂",
        "方年少　恨浮名误我　乐事输人"
      ],
      "geLyuSep": [
        "平仄平平句仄平平仄句仄平仄平韵",
        "仄仄平平仄句平平仄仄句平平平仄句平仄平平韵",
        "仄仄平平句平平平仄句平仄平平平仄平韵",
        "平平仄句仄平平仄仄句仄仄平平韵",
        "平平韵",
        "仄仄平平韵",
        "仄平仄读平平平仄平韵",
        "仄仄平平仄句平平仄仄句平平平仄句平仄平平韵",
        "平仄平平句仄平平仄句仄仄平平平仄平韵",
        "平平仄句仄平平仄仄句仄仄平平韵"
      ]
    },
    {
      "tune": "沁园春",
      "origin": "黄鹤楼前，吹笛之时，先生朗吟。想剑光飞过，朝游南岳，墨蓝放下，夜醉东邻。铛煮山川，粟藏世界，有明月清风知此音。还应笑，笑酿成白酒，散尽黄金。知音。自有相寻。休踏破葫芦折断琴。唱白蘋红蓼，庐山日暮，西风黄叶，渭水秋深。三入岳阳，再游湓浦，自一去悠悠直至今。桃源路，尽不妨来往，时共登临。",
      "geLyuStr": "平仄平平平仄平平平平仄平仄仄平平仄平平平仄仄平仄仄仄仄平平平仄平平仄平仄仄仄平仄平平平仄平平平仄仄仄平仄仄仄仄平平平平仄仄平平平仄仄平平仄仄平仄仄平平仄平平仄仄平平平仄仄仄平平平仄仄平仄平平仄仄仄仄平平仄仄平平平仄仄仄平平仄平仄平平",
      "rhymePos": [
        11,
        28,
        44,
        56,
        58,
        62,
        70,
        87,
        103,
        115
      ],
      "ciSep": [
        "黄鹤楼前　吹笛之时　先生朗吟",
        "想剑光飞过　朝游南岳　墨蓝放下　夜醉东邻",
        "铛煮山川　粟藏世界　有明月清风知此音",
        "还应笑　笑酿成白酒　散尽黄金",
        "知音",
        "自有相寻",
        "休踏破葫芦折断琴",
        "唱白蘋红蓼　庐山日暮　西风黄叶　渭水秋深",
        "三入岳阳　再游湓浦　自一去悠悠直至今",
        "桃源路　尽不妨来往　时共登临"
      ],
      "geLyuSep": [
        "平仄平平句平仄平平句平平仄平韵",
        "仄仄平平仄句平平平仄句仄平仄仄句仄仄平平韵",
        "平仄平平句仄平仄仄句仄平仄平平平仄平韵",
        "平平仄句仄仄平仄仄句仄仄平平韵",
        "平平韵",
        "仄仄平平韵",
        "平仄仄平平仄仄平韵",
        "仄仄平平仄句平平仄仄句平平平仄句仄仄平平韵",
        "平仄仄平句仄平平仄句仄仄仄平平仄仄平韵",
        "平平仄句仄仄平平仄句平仄平平韵"
      ]
    }
  ],
  "江城子": [
    {
      "tune": "江城子",
      "origin": "髻鬟狼藉黛眉长。出兰房。别檀郎。角声呜咽、星斗渐微茫。露冷月残人未起，留不住，泪千行。",
      "geLyuStr": "中中平中中中平仄平平中中平中中中中中仄仄平平中仄中平中仄仄中中仄仄平平",
      "rhymePos": [
        6,
        9,
        12,
        21,
        34
      ],
      "ciSep": [
        "髻鬟狼藉黛眉长",
        "出兰房",
        "别檀郎",
        "角声呜咽　星斗渐微茫",
        "露冷月残人未起　留不住　泪千行"
      ],
      "geLyuSep": [
        "中中平中中中平韵",
        "仄平平韵",
        "中中平韵",
        "中中中中读中仄仄平平韵",
        "中仄中平中仄仄句中中仄句仄平平韵"
      ]
    },
    {
      "tune": "江城子",
      "origin": "晚日金陵岸草平。落霞明。水无情。六代繁华、暗逐逝波声。空有姑苏台上月，如西子镜，照江城。",
      "geLyuStr": "仄仄平平仄仄平仄平平仄平平仄仄平平仄仄仄平平平仄平平平仄仄平平仄仄仄平平",
      "rhymePos": [
        6,
        9,
        12,
        21,
        35
      ],
      "ciSep": [
        "晚日金陵岸草平",
        "落霞明",
        "水无情",
        "六代繁华　暗逐逝波声",
        "空有姑苏台上月　如西子镜　照江城"
      ],
      "geLyuSep": [
        "仄仄平平仄仄平韵",
        "仄平平韵",
        "仄平平韵",
        "仄仄平平读仄仄仄平平韵",
        "平仄平平平仄仄句平平仄仄句仄平平韵"
      ]
    },
    {
      "tune": "江城子",
      "origin": "极浦烟消水鸟飞。离筵分手时。送金卮。渡口杨花、如雪任风吹。日暮空江波浪急，芳草岸，雨如丝。",
      "geLyuStr": "仄仄平平仄仄平平平平仄平仄平平仄仄平平平仄仄平平仄仄平平平仄仄平仄仄仄平平",
      "rhymePos": [
        6,
        11,
        14,
        23,
        36
      ],
      "ciSep": [
        "极浦烟消水鸟飞",
        "离筵分手时",
        "送金卮",
        "渡口杨花　如雪任风吹",
        "日暮空江波浪急　芳草岸　雨如丝"
      ],
      "geLyuSep": [
        "仄仄平平仄仄平韵",
        "平平平仄平韵",
        "仄平平韵",
        "仄仄平平读平仄仄平平韵",
        "仄仄平平平仄仄句平仄仄句仄平平韵"
      ]
    }
  ],
  "虞美人": [
    {
      "tune": "虞美人",
      "origin": "风回小院庭芜绿。柳眼春相续。凭阑半日独无言。依旧竹声新月、似当年。笙歌未散尊罍在。池面冰初解。烛明香暗画阑深。满鬓清霜残雪、思难禁。",
      "geLyuStr": "中平中仄平平仄中仄平平仄中平中仄仄平平中仄中平中仄仄平平中平仄仄平平仄中仄平平仄仄平平仄仄平平中仄中平中仄仄平平",
      "rhymePos": [
        6,
        11,
        18,
        27,
        34,
        39,
        46,
        55
      ],
      "ciSep": [
        "风回小院庭芜绿",
        "柳眼春相续",
        "凭阑半日独无言",
        "依旧竹声新月　似当年",
        "笙歌未散尊罍在",
        "池面冰初解",
        "烛明香暗画阑深",
        "满鬓清霜残雪　思难禁"
      ],
      "geLyuSep": [
        "中平中仄平平仄仄韵",
        "中仄平平仄韵",
        "中平中仄仄平平平韵",
        "中仄中平中仄读仄平平韵",
        "中平仄仄平平仄换仄韵",
        "中仄平平仄韵",
        "仄平平仄仄平平换平韵",
        "中仄中平中仄读仄平平韵"
      ]
    },
    {
      "tune": "虞美人",
      "origin": "修眉刷翠春痕聚。难剪愁来处。断丝无力绾繁华。也学落花流水、到天涯。那时错认章台去。却是阳关路。待将心恨趁杨花。不识相思一点、在谁家。",
      "geLyuStr": "平平仄仄平平仄平仄平平仄仄平平仄仄平平仄仄仄平平仄仄平平仄平仄仄平平仄仄仄平平仄仄平平仄仄平平仄仄平平仄仄仄平平",
      "rhymePos": [
        6,
        11,
        18,
        27,
        34,
        39,
        46,
        55
      ],
      "ciSep": [
        "修眉刷翠春痕聚",
        "难剪愁来处",
        "断丝无力绾繁华",
        "也学落花流水　到天涯",
        "那时错认章台去",
        "却是阳关路",
        "待将心恨趁杨花",
        "不识相思一点　在谁家"
      ],
      "geLyuSep": [
        "平平仄仄平平仄仄韵",
        "平仄平平仄韵",
        "仄平平仄仄平平平韵",
        "仄仄仄平平仄读仄平平韵",
        "仄平仄仄平平仄仄韵",
        "仄仄平平仄韵",
        "仄平平仄仄平平平韵",
        "仄仄平平仄仄读仄平平韵"
      ]
    },
    {
      "tune": "虞美人",
      "origin": "玉钩鸾柱调鹦鹉。宛转留春语。云屏冷落画堂空。薄晚春寒无奈、落花风。褰帘燕子低飞去。拂镜尘鸾舞。不知今夜月眉弯。谁佩同心双结、倚阑干。",
      "geLyuStr": "仄平平仄平平仄仄仄平平仄平平仄仄仄平平仄仄平平平仄仄平平平平仄仄平平仄仄仄平平仄仄平平仄仄平平平仄平平平仄仄平平",
      "rhymePos": [
        6,
        11,
        18,
        27,
        34,
        39,
        46,
        55
      ],
      "ciSep": [
        "玉钩鸾柱调鹦鹉",
        "宛转留春语",
        "云屏冷落画堂空",
        "薄晚春寒无奈　落花风",
        "褰帘燕子低飞去",
        "拂镜尘鸾舞",
        "不知今夜月眉弯",
        "谁佩同心双结　倚阑干"
      ],
      "geLyuSep": [
        "仄平平仄平平仄仄韵",
        "仄仄平平仄韵",
        "平平仄仄仄平平平韵",
        "仄仄平平平仄读仄平平韵",
        "平平仄仄平平仄仄韵",
        "仄仄平平仄韵",
        "仄平平仄仄平平换平韵",
        "平仄平平平仄读仄平平韵"
      ]
    }
  ],
  "苏幕遮": [
    {
      "tune": "苏幕遮",
      "origin": "碧云天，黄叶地。秋色连波，波上含烟翠。山映斜阳天接水。芳草无情，更在斜阳外。黯乡魂，追旅思。夜夜除非，好梦留人睡。明月楼高休独倚。酒入愁肠，化作相思泪。",
      "geLyuStr": "仄平平平仄仄中仄平平中仄平平仄中仄中平平仄仄中仄平平中仄平平仄仄平平平仄仄中仄平平中仄平平仄中仄中平平仄仄中仄中平中仄平平仄",
      "rhymePos": [
        5,
        14,
        21,
        30,
        36,
        45,
        52,
        61
      ],
      "ciSep": [
        "碧云天　黄叶地",
        "秋色连波　波上含烟翠",
        "山映斜阳天接水",
        "芳草无情　更在斜阳外",
        "黯乡魂　追旅思",
        "夜夜除非　好梦留人睡",
        "明月楼高休独倚",
        "酒入愁肠　化作相思泪"
      ],
      "geLyuSep": [
        "仄平平句平仄仄韵",
        "中仄平平句中仄平平仄韵",
        "中仄中平平仄仄韵",
        "中仄平平句中仄平平仄韵",
        "仄平平句平仄仄韵",
        "中仄平平句中仄平平仄韵",
        "中仄中平平仄仄韵",
        "中仄中平句中仄平平仄韵"
      ]
    }
  ]
};
